app/controllers/apartments_controller.rb

SELECT "apartments".* FROM "apartments"
---
  def index
    apartments = Apartment.all

INSERT INTO "apartments" ("street1", "street2", "city", "postal_code", "state", "country", "building_manager", "manager_phone", "manager_hours", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    apartment = Apartment.create(apartment_params)

SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @apartment = Apartment.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def usersapartments
    @user = User.find(params[:user_id])

SELECT  "apartments".* FROM "apartments" WHERE "apartments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "apartments" WHERE "apartments"."id" = $1  [["id", 2]]
---
  def destroy
    @apartment = Apartment.find(params[:id])
    @apartment.destroy

UPDATE "apartments" SET "street1" = $1, "created_at" = $2, "updated_at" = $3 WHERE "apartments"."id" = $4  [["street1", "83848"], ["created_at", "2018-11-30 21:30:14.562000"], ["updated_at", "2018-11-30 21:30:14.562000"], ["id", 7]]
---
  def update
    id = apartment_params[:id]

    Apartment.update(id, apartment_params)